Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Pickethall.tmx
Source language: ar
Languages: en

source: خالدين فيها أبدا إن الله عنده أجر عظيم
en: There they will abide for ever. Lo! with Allah there is immense reward.

source: يا أيها الذين آمنوا لا تتخذوا آباءكم وإخوانكم أولياء إن استحبوا الكفر على الإيمان ومن يتولهم منكم فأولئك هم الظالمون
en: O ye who believe! Choose not your fathers nor your brethren for friends if they take pleasure in disbelief rather than faith. Whoso of you taketh them for friends, such are wrong-doers.

source: قل إن كان آباؤكم وأبناؤكم وإخوانكم وأزواجكم وعشيرتكم وأموال اقترفتموها وتجارة تخشون كسادها ومساكن ترضونها أحب إليكم من الله ورسوله وجهاد في سبيله فتربصوا حتى يأتي الله بأمره والله لا يهدي القوم الفاسقين
en: Say: If your fathers, and your sons, and your brethren, and your wives, and your tribe, and the wealth ye have acquired, and merchandise for which ye fear that there will no sale, and dwellings ye desire are dearer to you than Allah and His messenger and striving in His way: then wait till Allah bringeth His command to pass. Allah guideth not wrongdoing folk.

source: لقد نصركم الله في مواطن كثيرة ويوم حنين إذ أعجبتكم كثرتكم فلم تغن عنكم شيئا وضاقت عليكم الأرض بما رحبت ثم وليتم مدبرين
en: Allah hath given you victory on many fields and on the day of Huneyn, when ye exulted in your multitude but it availed you naught, and the earth, vast as it is, was straitened for you; then ye turned back in flight;

source: ثم أنزل الله سكينته على رسوله وعلى المؤمنين وأنزل جنودا لم تروها وعذب الذين كفروا وذلك جزاء الكافرين
en: Then Allah sent His peace of reassurance down upon His messenger and upon the believers, and sent down hosts ye could not see, and punished those who disbelieved. Such is the reward of disbelievers.

source: ثم يتوب الله من بعد ذلك على من يشاء والله غفور رحيم
en: Then afterward Allah will relent toward whom He will; for Allah is Forgiving, Merciful.

source: يا أيها الذين آمنوا إنما المشركون نجس فلا يقربوا المسجد الحرام بعد عامهم هذا وإن خفتم عيلة فسوف يغنيكم الله من فضله إن شاء إن الله عليم حكيم
en: O ye who believe! The idolaters only are unclean. So let them not come near the Inviolable Place of Worship after this their year. If ye fear poverty (from the loss of their merchandise) Allah shall preserve you of His bounty if He will. Lo! Allah is Knower, Wise.

source: قاتلوا الذين لا يؤمنون بالله ولا باليوم الآخر ولا يحرمون ما حرم الله ورسوله ولا يدينون دين الحق من الذين أوتوا الكتاب حتى يعطوا الجزية عن يد وهم صاغرون
en: Fight against such of those who have been given the Scripture as believe not in Allah nor the Last Day, and forbid not that which Allah hath forbidden by His messenger, and follow not the Religion of Truth, until they pay the tribute readily, being brought low.

source: وقالت اليهود عزير ابن الله وقالت النصارى المسيح ابن الله ذلك قولهم بأفواههم يضاهئون قول الذين كفروا من قبل قاتلهم الله أنى يؤفكون
en: And the Jews say: Ezra is the son of Allah, and the Christians say: The Messiah is the son of Allah. That is their saying with their mouths. They imitate the saying of those who disbelieved of old. Allah (Himself) fighteth against them. How perverse are they!

source: اتخذوا أحبارهم ورهبانهم أربابا من دون الله والمسيح ابن مريم وما أمروا إلا ليعبدوا إلها واحدا لا إله إلا هو سبحانه عما يشركون
en: They have taken as lords beside Allah their rabbis and their monks and the Messiah son of Mary, when they were bidden to worship only One Allah. There is no Allah save Him. Be He Glorified from all that they ascribe as partner (unto Him)!

source: يريدون أن يطفئوا نور الله بأفواههم ويأبى الله إلا أن يتم نوره ولو كره الكافرون
en: Fain would they put out the light of Allah with their mouths, but Allah disdaineth (aught) save that He shall perfect His light, however much the disbelievers are averse.

source: هو الذي أرسل رسوله بالهدى ودين الحق ليظهره على الدين كله ولو كره المشركون
en: He it is Who hath sent His messenger with the guidance and the Religion of Truth, that He may cause it to prevail over all religion, however much the idolaters may be averse.

source: يا أيها الذين آمنوا إن كثيرا من الأحبار والرهبان ليأكلون أموال الناس بالباطل ويصدون عن سبيل الله والذين يكنزون الذهب والفضة ولا ينفقونها في سبيل الله فبشرهم بعذاب أليم
en: O ye who believe! Lo! many of the (Jewish) rabbis and the (Christian) monks devour the wealth of mankind wantonly and debar (men) from the way of Allah. They who hoard up gold and silver and spend it not in the way of Allah, unto them give tidings (O Muhammad) of a painful doom,

source: يوم يحمى عليها في نار جهنم فتكوى بها جباههم وجنوبهم وظهورهم هذا ما كنزتم لأنفسكم فذوقوا ما كنتم تكنزون
en: On the day when it will (all) be heated in the fire of hell, and their foreheads and their flanks and their backs will be branded therewith (and it will be said unto them): Here is that which ye hoarded for yourselves. Now taste of what ye used to hoard.

source: إن عدة الشهور عند الله اثنا عشر شهرا في كتاب الله يوم خلق السماوات والأرض منها أربعة حرم ذلك الدين القيم فلا تظلموا فيهن أنفسكم وقاتلوا المشركين كافة كما يقاتلونكم كافة واعلموا أن الله مع المتقين
en: Lo! the number of the months with Allah is twelve months by Allah's ordinance in the day that He created the heavens and the earth. Four of them are sacred: that is the right religion. So wrong not yourselves in them. And wage war on all of the idolaters as they are waging war on all of you. And know that Allah is with those who keep their duty (unto Him).

source: إنما النسيء زيادة في الكفر يضل به الذين كفروا يحلونه عاما ويحرمونه عاما ليواطئوا عدة ما حرم الله فيحلوا ما حرم الله زين لهم سوء أعمالهم والله لا يهدي القوم الكافرين
en: Postponement (of a sacred month) is only an excess of disbelief whereby those who disbelieve are misled; they allow it one year and forbid it (another) year, that they may make up the number of the months which Allah hath hallowed, so that they allow that which Allah hath forbidden. The evil of their deeds is made fairseeming unto them. Allah guideth not the disbelieving folk.

source: يا أيها الذين آمنوا ما لكم إذا قيل لكم انفروا في سبيل الله اثاقلتم إلى الأرض أرضيتم بالحياة الدنيا من الآخرة فما متاع الحياة الدنيا في الآخرة إلا قليل
en: O ye who believe! What aileth you that when it is said unto you: Go forth in the way of Allah, ye are bowed down to the ground with heaviness. Take ye pleasure in the life of the world rather than in the Hereafter? The comfort of the life of the world is but little in the Hereafter.

source: إلا تنفروا يعذبكم عذابا أليما ويستبدل قوما غيركم ولا تضروه شيئا والله على كل شيء قدير
en: If ye go not forth He will afflict you with a painful doom, and will choose instead of you a folk other than you. Ye cannot harm Him at all. Allah is Able to do all things.

source: إلا تنصروه فقد نصره الله إذ أخرجه الذين كفروا ثاني اثنين إذ هما في الغار إذ يقول لصاحبه لا تحزن إن الله معنا فأنزل الله سكينته عليه وأيده بجنود لم تروها وجعل كلمة الذين كفروا السفلى وكلمة الله هي العليا والله عزيز حكيم
en: If ye help him not, still Allah helped him when those who disbelieve drove him forth, the second of two; when they two were in the cave, when he said unto his comrade: Grieve not. Lo! Allah is with us. Then Allah caused His peace of reassurance to descend upon him and supported him with hosts ye cannot see, and made the word of those who disbelieved the nethermost, while Allah's Word it was that became the uppermost. Allah is Mighty, Wise.

source: انفروا خفافا وثقالا وجاهدوا بأموالكم وأنفسكم في سبيل الله ذلكم خير لكم إن كنتم تعلمون
en: Go forth, light-armed and heavy-armed, and strive with your wealth and your lives in the way of Allah! That is best for you if ye but knew.

source: لو كان عرضا قريبا وسفرا قاصدا لاتبعوك ولكن بعدت عليهم الشقة وسيحلفون بالله لو استطعنا لخرجنا معكم يهلكون أنفسهم والله يعلم إنهم لكاذبون
en: Had it been a near adventure and an easy journey they had followed thee, but the distance seemed too far for them. Yet will they swear by Allah (saying): If we had been able we would surely have set out with you. They destroy their souls, and Allah knoweth that they verily are liars.

source: عفا الله عنك لم أذنت لهم حتى يتبين لك الذين صدقوا وتعلم الكاذبين
en: Allah forgive thee (O Muhammad)! Wherefor didst thou grant them leave ere those who told the truth were manifest to thee and thou didst know the liars?

source: لا يستأذنك الذين يؤمنون بالله واليوم الآخر أن يجاهدوا بأموالهم وأنفسهم والله عليم بالمتقين
en: Those who believe in Allah and the Last Day ask no leave of thee lest they should strive with their wealth and their lives. Allah is Aware of those who keep their duty (unto Him).

source: إنما يستأذنك الذين لا يؤمنون بالله واليوم الآخر وارتابت قلوبهم فهم في ريبهم يترددون
en: They alone ask leave of thee who believe not in Allah and the Last Day, and whose hearts feel doubt, so in their doubt they waver.

source: ولو أرادوا الخروج لأعدوا له عدة ولكن كره الله انبعاثهم فثبطهم وقيل اقعدوا مع القاعدين
en: And if they had wished to go forth they would assuredly have made ready some equipment, but Allah was averse to their being sent forth and held them back and it was said (unto them): Sit ye with the sedentary!

source: لو خرجوا فيكم ما زادوكم إلا خبالا ولأوضعوا خلالكم يبغونكم الفتنة وفيكم سماعون لهم والله عليم بالظالمين
en: Had they gone forth among you they had added to you naught save trouble and had hurried to and fro among you, seeking to cause sedition among you; and among you there are some who would have listened to them. Allah is Aware of evil-doers.

source: لقد ابتغوا الفتنة من قبل وقلبوا لك الأمور حتى جاء الحق وظهر أمر الله وهم كارهون
en: Aforetime they sought to cause sedition and raised difficulties for thee till the Truth came and the decree of Allah was made manifest, though they were loth.

source: ومنهم من يقول ائذن لي ولا تفتني ألا في الفتنة سقطوا وإن جهنم لمحيطة بالكافرين
en: Of them is he who saith: Grant me leave (to stay at home) and tempt me not. Surely it is into temptation that they (thus) have fallen. Lo! hell verily is all around the disbelievers.

source: إن تصبك حسنة تسؤهم وإن تصبك مصيبة يقولوا قد أخذنا أمرنا من قبل ويتولوا وهم فرحون
en: If good befalleth thee (O Muhammad) it afflicteth them, and if calamity befalleth thee, they say: We took precaution, and they turn away well pleased.

source: قل لن يصيبنا إلا ما كتب الله لنا هو مولانا وعلى الله فليتوكل المؤمنون
en: Say: Naught befalleth us save that which Allah hath decreed for us. He is our Protecting Friend. In Allah let believers put their trust!

source: قل هل تربصون بنا إلا إحدى الحسنيين ونحن نتربص بكم أن يصيبكم الله بعذاب من عنده أو بأيدينا فتربصوا إنا معكم متربصون
en: Say: Can ye await for us aught save one of two good things (death or victory in Allah's way)? while we await for you that Allah will afflict you with a doom from Him or at our hands. Await then! Lo! We are awaiting with you.

source: قل أنفقوا طوعا أو كرها لن يتقبل منكم إنكم كنتم قوما فاسقين
en: Say: Pay (your contribution), willingly or unwillingly, it will not be accepted from you. Lo! ye were ever froward folk.

source: وما منعهم أن تقبل منهم نفقاتهم إلا أنهم كفروا بالله وبرسوله ولا يأتون الصلاة إلا وهم كسالى ولا ينفقون إلا وهم كارهون
en: And naught preventeth that their contributions should be accepted from them save that they have disbelieved in Allah and in His messenger, and they come not to worship save as idlers, and pay not (their contribution) save reluctantly.

source: فلا تعجبك أموالهم ولا أولادهم إنما يريد الله ليعذبهم بها في الحياة الدنيا وتزهق أنفسهم وهم كافرون
en: So let not their riches nor their children please thee (O Muhammad). Allah thereby intendeth but to punish them in the life of the world and that their souls shall pass away while they are disbelievers.

source: ويحلفون بالله إنهم لمنكم وما هم منكم ولكنهم قوم يفرقون
en: And they swear by Allah that they are in truth of you, when they are not of you, but they are folk who are afraid.

source: لو يجدون ملجأ أو مغارات أو مدخلا لولوا إليه وهم يجمحون
en: Had they but found a refuge, or caverns, or a place to enter, they surely had resorted thither swift as runaways.

source: ومنهم من يلمزك في الصدقات فإن أعطوا منها رضوا وإن لم يعطوا منها إذا هم يسخطون
en: And of them is he who defameth thee in the matter of the alms. If they are given thereof they are content, and if they are not given thereof, behold! they are enraged.

source: ولو أنهم رضوا ما آتاهم الله ورسوله وقالوا حسبنا الله سيؤتينا الله من فضله ورسوله إنا إلى الله راغبون
en: (How much more seemly) had they been content with that which Allah and His messenger had given them and had said: Allah sufficeth us. Allah will give us of His bounty, and (also) His messenger. Unto Allah we are suppliants.

source: إنما الصدقات للفقراء والمساكين والعاملين عليها والمؤلفة قلوبهم وفي الرقاب والغارمين وفي سبيل الله وابن السبيل فريضة من الله والله عليم حكيم
en: The alms are only for the poor and the needy, and those who collect them, and those whose hearts are to be reconciled, and to free the captives and the debtors, and for the cause of Allah, and (for) the wayfarer; a duty imposed by Allah. Allah is Knower, Wise.

source: ومنهم الذين يؤذون النبي ويقولون هو أذن قل أذن خير لكم يؤمن بالله ويؤمن للمؤمنين ورحمة للذين آمنوا منكم والذين يؤذون رسول الله لهم عذاب أليم
en: And of them are those who vex the Prophet and say: He is only a hearer. Say: A hearer of good for you, who believeth in Allah and is true to the believers, and a mercy for such of you as believe. Those who vex the messenger of Allah, for them there is a painful doom.

source: يحلفون بالله لكم ليرضوكم والله ورسوله أحق أن يرضوه إن كانوا مؤمنين
en: They swear by Allah to you (Muslims) to please you, but Allah, with His messenger, hath more right that they should please Him if they are believers.

source: ألم يعلموا أنه من يحادد الله ورسوله فأن له نار جهنم خالدا فيها ذلك الخزي العظيم
en: Know they not that whoso opposeth Allah and His messenger, his verily is fire of hell, to abide therein? That is the extreme abasement.

source: يحذر المنافقون أن تنزل عليهم سورة تنبئهم بما في قلوبهم قل استهزئوا إن الله مخرج ما تحذرون
en: The hypocrites fear lest a surah should be revealed concerning them, proclaiming what is in their hearts. Say: Scoff (your fill)! Lo! Allah is disclosing what ye fear.

source: ولئن سألتهم ليقولن إنما كنا نخوض ونلعب قل أبالله وآياته ورسوله كنتم تستهزئون
en: And if thou ask them (O Muhammad) they will say: We did but talk and jest. Say: Was it at Allah and His revelations and His messenger that ye did scoff?

source: لا تعتذروا قد كفرتم بعد إيمانكم إن نعف عن طائفة منكم نعذب طائفة بأنهم كانوا مجرمين
en: Make no excuse. Ye have disbelieved after your (confession of) belief. If We forgive a party of you, a party of you We shall punish because they have been guilty.

source: المنافقون والمنافقات بعضهم من بعض يأمرون بالمنكر وينهون عن المعروف ويقبضون أيديهم نسوا الله فنسيهم إن المنافقين هم الفاسقون
en: The hypocrites, both men and women, proceed one from another. They enjoin the wrong, and they forbid the right, and they withhold their hands (from spending for the cause of Allah). They forget Allah, so He hath forgotten them. Lo! the hypocrites, they are the transgressors.

source: وعد الله المنافقين والمنافقات والكفار نار جهنم خالدين فيها هي حسبهم ولعنهم الله ولهم عذاب مقيم
en: Allah promiseth the hypocrites, both men and women, and the disbelievers fire of hell for their abode. It will suffice them. Allah curseth them, and theirs is lasting torment.

source: كالذين من قبلكم كانوا أشد منكم قوة وأكثر أموالا وأولادا فاستمتعوا بخلاقهم فاستمتعتم بخلاقكم كما استمتع الذين من قبلكم بخلاقهم وخضتم كالذي خاضوا أولئك حبطت أعمالهم في الدنيا والآخرة وأولئك هم الخاسرون
en: Even as those before you who were mightier than you in strength, and more affluent than you in wealth and children. They enjoyed their lot awhile, so ye enjoy your lot awhile even as those before you did enjoy their lot awhile. And ye prate even as they prated. Such are they whose works have perished in the world and the Hereafter. Such are they who are the losers.

source: ألم يأتهم نبأ الذين من قبلهم قوم نوح وعاد وثمود وقوم إبراهيم وأصحاب مدين والمؤتفكات أتتهم رسلهم بالبينات فما كان الله ليظلمهم ولكن كانوا أنفسهم يظلمون
en: Hath not the fame of those before them reached them - the folk of Noah, A'ad, Thamud, the folk of Abraham, the dwellers of Midian and the disasters (which befell them)? Their messengers (from Allah) came unto them with proofs (of Allah's Sovereignty). So Allah surely wronged them not, but they did wrong themselves.

source: والمؤمنون والمؤمنات بعضهم أولياء بعض يأمرون بالمعروف وينهون عن المنكر ويقيمون الصلاة ويؤتون الزكاة ويطيعون الله ورسوله أولئك سيرحمهم الله إن الله عزيز حكيم
en: And the believers, men and women, are protecting friends one of another; they enjoin the right and forbid the wrong, and they establish worship and they pay the poor-due, and they obey Allah and His messenger. As for these, Allah will have mercy on them. Lo! Allah is Mighty, Wise.

source: وعد الله المؤمنين والمؤمنات جنات تجري من تحتها الأنهار خالدين فيها ومساكن طيبة في جنات عدن ورضوان من الله أكبر ذلك هو الفوز العظيم
en: Allah promiseth to the believers, men and women, Gardens underneath which rivers flow, wherein they will abide - blessed dwellings in Gardens of Eden. And - greater (far)! - acceptance from Allah. That is the supreme triumph.

source: يا أيها النبي جاهد الكفار والمنافقين واغلظ عليهم ومأواهم جهنم وبئس المصير
en: O Prophet! Strive against the disbelievers and the hypocrites! Be harsh with them. Their ultimate abode is hell, a hapless journey's end.

source: يحلفون بالله ما قالوا ولقد قالوا كلمة الكفر وكفروا بعد إسلامهم وهموا بما لم ينالوا وما نقموا إلا أن أغناهم الله ورسوله من فضله فإن يتوبوا يك خيرا لهم وإن يتولوا يعذبهم الله عذابا أليما في الدنيا والآخرة وما لهم في الأرض من ولي ولا نصير
en: They swear by Allah that they said nothing (wrong), yet they did say the word of disbelief, and did disbelieve after their Surrender (to Allah). And they purposed that which they could not attain, and they sought revenge only that Allah by His messenger should enrich them of His bounty. If they repent it will be better for them; and if they turn away, Allah will afflict them with a painful doom in the world and the Hereafter, and they have no protecting friend nor helper in the earth.

source: ومنهم من عاهد الله لئن آتانا من فضله لنصدقن ولنكونن من الصالحين
en: And of them is he who made a covenant with Allah (saying): If He give us of His bounty we will give alms and become of the righteous.

source: فلما آتاهم من فضله بخلوا به وتولوا وهم معرضون
en: Yet when He gave them of His bounty, they hoarded it and turned away, averse;

source: فأعقبهم نفاقا في قلوبهم إلى يوم يلقونه بما أخلفوا الله ما وعدوه وبما كانوا يكذبون
en: So He hath made the consequence (to be) hypocrisy in their hearts until the day when they shall meet Him, because they broke their word to Allah that they promised Him, and because they lied.

source: ألم يعلموا أن الله يعلم سرهم ونجواهم وأن الله علام الغيوب
en: Know they not that Allah knoweth both their secret and the thought that they confide, and that Allah is the Knower of Things Hidden?

source: الذين يلمزون المطوعين من المؤمنين في الصدقات والذين لا يجدون إلا جهدهم فيسخرون منهم سخر الله منهم ولهم عذاب أليم
en: Those who point at such of the believers as give the alms willingly and such as can find naught to give but their endeavours, and deride them - Allah (Himself) derideth them. Theirs will be a painful doom.

source: استغفر لهم أو لا تستغفر لهم إن تستغفر لهم سبعين مرة فلن يغفر الله لهم ذلك بأنهم كفروا بالله ورسوله والله لا يهدي القوم الفاسقين
en: Ask forgiveness for them (O Muhammad), or ask not forgiveness for them; though thou ask forgiveness for them seventy times Allah will not forgive them. That is because they disbelieved in Allah and His messenger, and Allah guideth not wrongdoing folk.

source: فرح المخلفون بمقعدهم خلاف رسول الله وكرهوا أن يجاهدوا بأموالهم وأنفسهم في سبيل الله وقالوا لا تنفروا في الحر قل نار جهنم أشد حرا لو كانوا يفقهون
en: Those who were left behind rejoiced at sitting still behind the messenger of Allah, and were averse to striving with their wealth and their lives in Allah's way. And they said: Go not forth in the heat! Say: The fire of hell is more intense of heat, if they but understood.

source: فليضحكوا قليلا وليبكوا كثيرا جزاء بما كانوا يكسبون
en: Then let them laugh a little: they will weep much, as the reward of what they used to earn.

source: فإن رجعك الله إلى طائفة منهم فاستأذنوك للخروج فقل لن تخرجوا معي أبدا ولن تقاتلوا معي عدوا إنكم رضيتم بالقعود أول مرة فاقعدوا مع الخالفين
en: If Allah bring thee back (from the campaign) unto a party of them and they ask of thee leave to go out (to fight), then say unto them: Ye shall never more go out with me nor fight with me against a foe. Ye were content with sitting still the first time. So sit still, with the useless.

source: ولا تصل على أحد منهم مات أبدا ولا تقم على قبره إنهم كفروا بالله ورسوله وماتوا وهم فاسقون
en: And never (O Muhammad) pray for one of them who dieth, nor stand by his grave. Lo! they disbelieved in Allah and His messenger, and they died while they were evil-doers.

source: ولا تعجبك أموالهم وأولادهم إنما يريد الله أن يعذبهم بها في الدنيا وتزهق أنفسهم وهم كافرون
en: Let not their wealth nor their children please thee! Allah purposeth only to punish them thereby in the world, and that their souls shall pass away while they are disbelievers.

source: وإذا أنزلت سورة أن آمنوا بالله وجاهدوا مع رسوله استأذنك أولو الطول منهم وقالوا ذرنا نكن مع القاعدين
en: And when a surah is revealed (which saith): Believe in Allah and strive along with His messenger, the men of wealth among them still ask leave of thee and say: Suffer us to be with those who sit (at home).

source: رضوا بأن يكونوا مع الخوالف وطبع على قلوبهم فهم لا يفقهون
en: They are content that they should be with the useless and their hearts are sealed, so that they apprehend not.

source: لكن الرسول والذين آمنوا معه جاهدوا بأموالهم وأنفسهم وأولئك لهم الخيرات وأولئك هم المفلحون
en: But the messenger and those who believe with him strive with their wealth and their lives. Such are they for whom are the good things. Such are they who are the successful.

source: أعد الله لهم جنات تجري من تحتها الأنهار خالدين فيها ذلك الفوز العظيم
en: Allah hath made ready for them Gardens underneath which rivers flow, wherein they will abide. That is the supreme triumph.

source: وجاء المعذرون من الأعراب ليؤذن لهم وقعد الذين كذبوا الله ورسوله سيصيب الذين كفروا منهم عذاب أليم
en: And those among the wandering Arabs who had an excuse came in order that permission might be granted them. And those who lied to Allah and His messenger sat at home. A painful doom will fall on those of them who disbelieve.

source: ليس على الضعفاء ولا على المرضى ولا على الذين لا يجدون ما ينفقون حرج إذا نصحوا لله ورسوله ما على المحسنين من سبيل والله غفور رحيم
en: Not unto the weak nor unto the sick nor unto those who can find naught to spend is any fault (to be imputed though they stay at home) if they are true to Allah and His messenger. Not unto the good is there any road (of blame). Allah is Forgiving, Merciful.

source: ولا على الذين إذا ما أتوك لتحملهم قلت لا أجد ما أحملكم عليه تولوا وأعينهم تفيض من الدمع حزنا ألا يجدوا ما ينفقون
en: Nor unto those whom, when they came to thee (asking) that thou shouldst mount them, thou didst tell: I cannot find whereon to mount you. They turned back with eyes flowing with tears, for sorrow that they could not find the means to spend.

source: إنما السبيل على الذين يستأذنونك وهم أغنياء رضوا بأن يكونوا مع الخوالف وطبع الله على قلوبهم فهم لا يعلمون
en: The road (of blame) is only against those who ask for leave of thee (to stay at home) when they are rich. They are content to be with the useless. Allah hath sealed their hearts so that they know not.
